In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.read_csv("/home/sajid/Desktop/Quarter_2/Sir Anees git repo/examples/sample.csv")

In [4]:
data

  studentid         name   chimestry   physics   english   math
0       A01     arif ali          20        30        40     50
1       A02  kamran khan          30        40        50     60
2       A03   imran ali           40        50        60     70
3       A04  kashif khan          50        60        70     80

In [5]:
data.index=[chr(i) for i in range(97,101)]

In [6]:
data

  studentid         name   chimestry   physics   english   math
a       A01     arif ali          20        30        40     50
b       A02  kamran khan          30        40        50     60
c       A03   imran ali           40        50        60     70
d       A04  kashif khan          50        60        70     80

In [27]:
data=pd.read_csv("/home/sajid/Desktop/Quarter_2/Sir Anees git repo/examples/sample.csv",
                 skiprows=1,
                 names=["id","name","che","phy","eng","math"])

In [28]:
data

    id         name  che  phy  eng  math
0  A01     arif ali   20   30   40    50
1  A02  kamran khan   30   40   50    60
2  A03   imran ali    40   50   60    70
3  A04  kashif khan   50   60   70    80

In [31]:
# a previous remainig topic     frame.rank
frame=pd.DataFrame(np.random.randint(1,100,4*4).reshape(4,4))
frame

    0   1   2   3
0  67  14  40  78
1  53  67  86  91
2   3  16  28  85
3  61  90  24  63

In [33]:
frame.sort_values(by=2)

    0   1   2   3
3  61  90  24  63
2   3  16  28  85
0  67  14  40  78
1  53  67  86  91

In [38]:
frame.sort_values(by=3,axis=1)

    2   0   3   1
0  40  67  78  14
1  86  53  91  67
2  28   3  85  16
3  24  61  63  90

In [39]:
frame.index=[5,6,7,8]

In [48]:
frame.sort_values(by=[6],axis=1)     #sort values by row

    0   1   2   3
5  67  14  40  78
6  53  67  86  91
7   3  16  28  85
8  61  90  24  63

In [50]:
frame.rank()

     0    1    2    3
5  4.0  1.0  3.0  2.0
6  2.0  3.0  4.0  4.0
7  1.0  2.0  2.0  3.0
8  3.0  4.0  1.0  1.0

In [55]:
data.columns

Index(['id', 'name', 'che', 'phy', 'eng', 'math'], dtype='object')

In [56]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [61]:
data=pd.read_csv("/home/sajid/Desktop/Quarter_2/Sir Anees git repo/examples/sample.csv",
                 skiprows=1,
                 names=["id","name","che","phy","eng","math"],
                index_col="math"
                )
data

       id         name  che  phy  eng
math
50    A01     arif ali   20   30   40
60    A02  kamran khan   30   40   50
70    A03   imran ali    40   50   60
80    A04  kashif khan   50   60   70

In [64]:
data=pd.read_csv("/home/sajid/Desktop/Quarter_2/Sir Anees git repo/examples/sample.csv",
                 skiprows=1,
                 names=["id","name","che","phy","eng","math"],
                index_col=["math","che"]
                )
data.index

MultiIndex([(50, 20),
            (60, 30),
            (70, 40),
            (80, 50)],
           names=['math', 'che'])

In [70]:
list(open("/home/sajid/Desktop/Quarter_2/Sir Anees git repo/examples/sample.csv"))

['studentid, name, chimestry, physics, english, math\n',
 'A01,arif ali, 20, 30, 40, 50\n',
 'A02,kamran khan, 30, 40, 50, 60\n',
 'A03,imran ali , 40, 50, 60,70\n',
 'A04,kashif khan, 50, 60, 70, 80\n']